local M = {}

M.tPay = {
	[1]={
		value = 10,
		name = "房卡X10张",
		id    = 100021,
		send = "再赠送1张房卡"
	},
	[2]={
		value = 20,
		name = "房卡X20张",
		id    = 100022,
		send = "再赠送4张房卡"
	},
	[3]={
		value = 50,
		name = "房卡X50张",
		id    = 100023,
		send = "再赠送15张房卡"
	},
	[4]={
		value = 100,
		name = "房卡X100张",
		id    = 100024,
		send = "再赠送35张房卡"
	},
	[6]={
		value = 2,
		name = "最高获得4张房卡",
		id    = 100026,
	},
	[7]={
		value = 4,
		name = "最高获得8张房卡",
		id    = 100027,
	},
	[8]={
		value = 10,
		name = "最高获得20张房卡",
		id    = 100028,
	},
	[9]={
		value = 18,
		name = "最高获得36张房卡",
		id    = 100029,
	},
	[10]={
		value = 30,
		name = "最高获得60张房卡",
		id    = 100030,
	},
	[11]={
		value = 50,
		name = "最高获得100张房卡",
		id    = 100031,
	},
	[12]={
		value = 300,
		name = "300元代理",
		id    = 100032,
	},
}

-- 支付宝
M.ZFB_PAY = 401
-- 微信
M.WX_PAY = 403

return M